{
  "namespace": "lilac",
  "concept_name": "legal-termination",
  "type": "text",
  "metadata": {
    "is_public": true,
    "tags": ["legal"],
    "description": "Termination or survival clause in a legal document"
  },
  "version": 33,
  "data": {
    "731b1338cf1949958c3526c555f88058": {
      "label": true,
      "text": "In the event that any provision of this agreement is found to be unenforceable, the remaining provisions shall continue to be valid and binding.",
      "id": "731b1338cf1949958c3526c555f88058"
    },
    "99a20e547e38474dbc24507a1658d0c9": {
      "label": true,
      "text": "The parties agree that in the event of a natural disaster or other unforeseen event, both parties will make reasonable efforts to fulfill their obligations under this contract.",
      "id": "99a20e547e38474dbc24507a1658d0c9"
    },
    "3f27b47c526a4c5896a0a100024535c7": {
      "label": true,
      "text": "If any party breaches the terms of this agreement, the non-breaching party shall have the right to seek legal remedies.",
      "id": "3f27b47c526a4c5896a0a100024535c7"
    },
    "d403dbb1ab9c4594bc7f7dcb0ad5b333": {
      "label": true,
      "text": "This lease agreement shall survive the termination or expiration of the lease term, and continue to be binding upon the parties.",
      "id": "d403dbb1ab9c4594bc7f7dcb0ad5b333"
    },
    "b7deba9f7e80444abe14448f53f45c43": {
      "label": true,
      "text": "In the event of a dispute arising from this contract, the parties agree to first attempt to resolve the dispute through mediation before pursuing any legal action.",
      "id": "b7deba9f7e80444abe14448f53f45c43"
    },
    "a82231b490174e62aad733cb0c75024d": {
      "label": true,
      "text": "This Agreement may be terminated, and the transactions contemplated hereby may be abandoned, at any time prior to the Effective Time, whether prior to or after the Company Stockholders' Approval:",
      "id": "a82231b490174e62aad733cb0c75024d"
    },
    "160b25dbf14e4759a0065bbd652ce33f": {
      "label": true,
      "text": "This Agreement may be terminated and abandoned at any time prior to the Effective Time of the Merger, whether before or after the Company Stockholder Approval:",
      "id": "160b25dbf14e4759a0065bbd652ce33f"
    },
    "8f5f9f96b16441228bb0c9b8a14c4e25": {
      "label": false,
      "text": "any jurisdiction, then such provision shall, as to such jurisdiction, be modified or restricted to the extent necessary to make such provision valid, binding and enforceable, or if such provision cannot be so modified or restricted, then such provision shall, as to such jurisdiction, be deemed to be excised from this Agreement; provided, however, that the legality, binding effect and",
      "id": "8f5f9f96b16441228bb0c9b8a14c4e25"
    },
    "87b6c31b04a346b4a3e0da8d2cc5a7ac": {
      "label": true,
      "text": "This Agreement shall terminate automatically without any further action by any party hereto upon the earliest to occur of (a) the Effective Time of the Merger, (b) the termination of the Merger Agreement in accordance with its terms and (c) any amendment or other modification of the Merger Agreement that reduces the amount of the Merger Consideration or provides that the Merger Consideration shall",
      "id": "87b6c31b04a346b4a3e0da8d2cc5a7ac"
    },
    "985344f7ecfb41f4a69ba101973221a1": {
      "label": false,
      "text": " During the Employment Period, the Corporation shall pay ----------- the Executive a base salary which, as of the commencement of the Employment Period, shall be at an annual rate of Two Hundred Fifty Thousand Dollars ($250,000). The base salary shall be payable in equal periodic installments which are not less frequent than the periodic installments in effect for salaries of other senior",
      "id": "985344f7ecfb41f4a69ba101973221a1"
    },
    "5d53ff48376046fdab41e95c7f4bad54": {
      "label": true,
      "text": "This Agreement may be terminated at any time prior to the Closing Date solely:",
      "id": "5d53ff48376046fdab41e95c7f4bad54"
    },
    "bdeb785be2154b21b4eb052466fa9bcb": {
      "label": true,
      "text": "(a) This Agreement may be terminated by you by notice to the Company at any time prior to the Closing Date if any of the following has occurred: (i) since the respective dates as of which information is given in the Registration Statement and the Prospectus, any material adverse change or any development involving a prospective material adverse change in or affecting the earnings, busi ness,",
      "id": "bdeb785be2154b21b4eb052466fa9bcb"
    },
    "fe6871e9070441f8a9e4b3db26b077d7": {
      "label": true,
      "text": "Section 3(b), this Section 7 and Section 8 of this Agreement shall survive a termination of this Agreement pursuant to (a) or (b) above in this Section 7 until the date that is two years following the date of such termination. Notwithstanding anything else to the contrary contained herein or in the Merger Agreement, if the Effective Time occurs, the representations and warranties contained in",
      "id": "fe6871e9070441f8a9e4b3db26b077d7"
    },
    "bf1a51751d0748e58c344aec8e5fc789": {
      "label": false,
      "text": "This Agreement may be executed in one or more counterparts (including counterparts executed and delivered by facsimile, which shall be as counterparts executed and delivered manually), all of which shall be considered one and the same agreement and shall become effective when one or more counterparts have been signed by each of the parties and delivered to the other party, it being understood that",
      "id": "bf1a51751d0748e58c344aec8e5fc789"
    },
    "bc1b2affa6d848fd92d4dee033e30659": {
      "label": false,
      "text": "would, in your judgment, make it impracticable or inadvisable to market the Units or to enforce contracts for the sale of the Units, (iii) suspension of trading in securities generally on the New York Stock Exchange, the American Stock Exchange or the Nasdaq National Market or limitation on prices (other than limitations on hours or numbers of days of trading) for securities on any such Exchange,",
      "id": "bc1b2affa6d848fd92d4dee033e30659"
    },
    "67a73d5887f74a91bed190ca8f64b17c": {
      "label": false,
      "text": " The authorized capital stock of FM consists of 1,000 shares of Common Stock, no par value each, of which 1,000 shares are issued and outstanding. There are no outstanding or authorized options, warrants, calls, subscriptions, rights (including any preemptive rights or rights of first refusal), agreements or commitments of any character obligating FM to issue any stock or any other Equity",
      "id": "67a73d5887f74a91bed190ca8f64b17c"
    },
    "025b2ca5147849c8a921d9aaa31cd9cd": {
      "label": false,
      "text": "Taxes that are being contested in good faith by appropriate proceedings, provided that Holdings, the Borrower or Restricted Subsidiary, as the case may be, has set aside on its books adequate reserves therefor in accordance with GAAP.",
      "id": "025b2ca5147849c8a921d9aaa31cd9cd"
    },
    "76acff27f13743f4822a094c707d8b75": {
      "label": false,
      "text": "have been a suspension or material limitation in trading in the Company’s common stock on the New York Stock Exchange; (iii) there shall have been a general moratorium on commercial banking activities declared by either federal or New York state authorities or a material disruption in commercial banking or securities settlement or clearance services in the United States; (iv) there shall have been",
      "id": "76acff27f13743f4822a094c707d8b75"
    },
    "b11a95c0eb564445b1a473e90622f861": {
      "label": true,
      "text": "10.1. This Agreement will terminate:",
      "id": "b11a95c0eb564445b1a473e90622f861"
    },
    "d536428a02084d94ba18d412851cb913": {
      "label": false,
      "text": "may not be limited to his Base Salary and that the Employee may receive an annual bonus in the amount, if any, determined annually by the Employer. The Employee shall also participate in employee compensation and benefit plans available generally to executives of the Employer (including, without limitation, any tax-qualified profit sharing plan, nonqualified profit sharing plan, life insurance",
      "id": "d536428a02084d94ba18d412851cb913"
    },
    "368bb1d9c7d0419d9ca58f28565eeb2e": {
      "label": true,
      "text": "This Agreement may be terminated in the absolute discretion of the Representatives, by notice to the Bank, if after execution and delivery of this Agreement and prior to the Closing Date (i) there has been, since the date of this Agreement or since the respective dates as of which information is given in the Registration Statement, the Time of Sale Information or the Prospectus, any material",
      "id": "368bb1d9c7d0419d9ca58f28565eeb2e"
    },
    "1b5fd7b037a84404bf85c858953c79e8": {
      "label": true,
      "text": "however, (i) the right to terminate this Agreement under this Section 8 shall not be available to such Buyer if the failure of the transactions contemplated by this Agreement to have been consummated by such date is the result of such Buyer’s breach of this Agreement and (ii) the abandonment of the sale and purchase of the Notes and the Warrants shall be applicable only to such Buyer providing",
      "id": "1b5fd7b037a84404bf85c858953c79e8"
    },
    "6d5a23d2663f457cab96df03d9dc8ab7": {
      "label": true,
      "text": "In addition, any Stockholder may terminate this Agreement if Weatherford, WEUS, or the Company breaches any representation, warranty, covenant or other agreement contained in the Merger Agreement that (A) would give rise to the failure of Weatherford, WEUS, or the Company to satisfy any condition set forth in Section 8.2(a) thereof, and (B) cannot be or has not been cured within 45 days after the",
      "id": "6d5a23d2663f457cab96df03d9dc8ab7"
    },
    "4a8223a48f83491b9b3eafd7ad37baf9": {
      "label": true,
      "text": "The obligations of the Underwriters hereunder may be terminated by the Representatives, in their absolute discretion, by notice given to and received by the Depositor or the Bank prior to delivery of and payment for the Notes if, prior to that time, any of the events described in Section 5(v) shall have occurred or any of the other conditions described in Section 5 shall not be satisfied.",
      "id": "4a8223a48f83491b9b3eafd7ad37baf9"
    },
    "fbb152eae00c440bb2d0df0fbd82c262": {
      "label": true,
      "text": "Either of the parties hereto may terminate this Agreement by giving to the other party a notice in writing specifying the date of such termination, which shall be not less than 60 days after the date of receipt of such notice. In the event such notice is given by the Customer, it shall be accompanied by a copy of a resolution of the Board of Directors of the Customer, certified by its Secretary,",
      "id": "fbb152eae00c440bb2d0df0fbd82c262"
    },
    "1d21880f426c45ada31409d22815cc87": {
      "label": false,
      "text": "Prospectus or the Final Prospectus (exclusive of any amendment or supplement thereof or thereto after the date hereof).",
      "id": "1d21880f426c45ada31409d22815cc87"
    },
    "795cac72a3504740bc7401a84fc6fba4": {
      "label": true,
      "text": "This Agreement may be terminated by the Customer or the Bank by giving ninety (90) days written notice to the other, provided that such notice to the Bank shall specify the names of the persons to whom the Bank shall deliver the Assets in the Accounts. If notice of termination is given by the Bank, the Customer shall, within ninety (90) days following receipt of the notice, deliver to the Bank Instructions specifying the names of the persons to whom the Bank shall deliver the Assets.",
      "id": "795cac72a3504740bc7401a84fc6fba4"
    },
    "3b82e6eba4894ac0b9f7f12aba2aab2e": {
      "label": false,
      "text": "of this Agreement, or to Authorized Persons, or may continue to hold the Assets until Instructions are provided to the Bank.",
      "id": "3b82e6eba4894ac0b9f7f12aba2aab2e"
    },
    "da16bd0e9dce4d4c87400eab61b9b14c": {
      "label": false,
      "text": "into force of the Convention. In such event, the Convention shall cease to have effect:",
      "id": "da16bd0e9dce4d4c87400eab61b9b14c"
    },
    "02cc328109984db094b0b02caec0d575": {
      "label": true,
      "text": "Survival.  The rights and obligations contained in Sections 3 (“Ownership of Work Product”), 4 (“Other Rights”), 5 (“License to Preexisting IP”), 6 (“Representations and Warranties”), 8 (“Confidential Information”) and 12 (“Non-solicitation”) will survive any termination or expiration of this Agreement. ",
      "id": "02cc328109984db094b0b02caec0d575"
    },
    "f8edf65d9acf4ff4a04459a3492ac426": {
      "label": false,
      "text": "Severability.  Should any provisions of this Agreement be held by a court of law to be illegal, invalid or unenforceable, the legality, validity and enforceability of the remaining provisions of this Agreement will not be affected or impaired thereby. ",
      "id": "f8edf65d9acf4ff4a04459a3492ac426"
    },
    "5a8517f359494ead8c11b6aff440480d": {
      "label": false,
      "text": "\u0095\tCommitted to deliver the best, we leave no room for customer grievances.\r\n\r\n",
      "id": "5a8517f359494ead8c11b6aff440480d"
    },
    "a47d327d0f6e46fc861f86b2e0e54a2f": {
      "label": false,
      "text": "the due diligence and using our agreement creator to close the deal successfully. \r",
      "id": "a47d327d0f6e46fc861f86b2e0e54a2f"
    },
    "811d0dcc92e14c5c881e903c7d4ff7b6": {
      "label": false,
      "text": "in accordance with customary procedures in the relevant markets, but in any event for a settlement period no longer than three months following the date of such commitment.",
      "id": "811d0dcc92e14c5c881e903c7d4ff7b6"
    },
    "907f92e0d5704418944a559a4bfb96c7": {
      "label": false,
      "text": "terminate in accordance with Section 2 of the Investors’ Rights Agreement.",
      "id": "907f92e0d5704418944a559a4bfb96c7"
    }
  }
}
